export const QuestionData = [
  {
    id: 1,
    title: "고양이가 집안 곳곳을 탐색할 때 나는 어떻게 하나요?",
    answera: "곁에서 지켜보며 고양이가 탐색하는 모습을 관심 있게 본다.",
    answerb: "고양이가 혼자 탐색할 수 있도록 냅둔다.",
    type: "EI",
  },
  {
    id: 2,
    title: "고양이가 새로운 장난감에 관심을 보이지 않는다. 나의 대처 방법은?",
    answera:
      "다양한 방법을 시도하며 고양이가 장난감에 관심을 가지도록 유도한다.",
    answerb: "고양이가 스스로 장난감에 관심을 보일 때까지 기다린다.",
    type: "EI",
  },
  {
    id: 3,
    title: "아무리봐도 우리 고양이가 정말 이쁜 것 같다. 나의 행동은?",
    answera:
      "'너무 이쁜 것 같아.. 사람들한테 자랑해야지..!!'하며 인스타를 만들어서 사진도 공유하고 소통도 한다.",
    answerb: "우리 고양이 너무 이쁘다.. 사진찍어서 사진첩에 간직한다.",
    type: "EI",
  },
  {
    id: 4,
    title:
      "고양이의 건강을 위해 새로운 사료를 고르는 중이다. 나의 접근 방식은?",
    answera: "성분과 영양 정보를 꼼꼼히 비교 분석한다.",
    answerb: "다른 집사들의 리뷰와 추천을 참고한다.",
    type: "SN",
  },
  {
    id: 5,
    title:
      "내 고양이가 갑자기 밤에 활동적으로 변했다. 나는 이 상황을 어떻게 해석할까?",
    answera:
      "고양이의 신체적 건강이나 식습관에 변화가 생겼는지 구체적으로 조사한다.",
    answerb:
      "밤에 활동적인 고양이의 행동 뒤에 숨겨진 심리적 또는 환경적 요인을 고민해 본다.",
    type: "SN",
  },
  {
    id: 6,
    title: "고양이가 식사를 거부한다면 나는 어떻게 할까?",
    answera:
      "고양이의 식사 패턴과 건강 상태를 관찰하여 문제의 원인을 찾아본다.",
    answerb:
      "고양이의 기분이나 환경 변화 등 더 큰 그림을 고려하여 문제에 접근한다.",
    type: "SN",
  },
  {
    id: 7,
    title: "고양이가 새로운 환경에서 불안해 보일 때, 당신은 어떻게 반응하나요?",
    answera:
      "고양이가 빨리 적응할 수 있도록 환경을 조절하는 논리적인 방안을 생각한다.",
    answerb:
      "고양이의 불안감을 직접 달래주며, 안정감을 제공하기 위해 노력한다.",
    type: "TF",
  },
  {
    id: 8,
    title:
      "친구가 고양이를 집에 데려오고 싶어하지만, 알레르기가 있는 경우, 당신의 조언은?",
    answera: "알레르기 치료와 관리에 대한 실질적인 조언을 제공한다.",
    answerb: "친구의 상황에 공감하며, 감정적인 지지를 표현한다.",
    type: "TF",
  },
  {
    id: 9,
    title:
      "당신의 고양이가 음식을 골라먹기 시작했습니다. 이에 대한 당신의 접근 방식은?",
    answera: "영양가와 건강에 기반하여 최적의 식단을 구성하는 방법을 찾는다.",
    answerb:
      "고양이가 특정 음식을 선호하는 이유를 이해하고, 그 선호를 존중한다.",
    type: "TF",
  },
  {
    id: 10,
    title: "주말에 고양이와 함께 할 활동을 계획할 때, 당신의 접근 방식은?",
    answera:
      "미리 고양이와의 활동 계획을 세우고, 준비해야 할 것들을 체크리스트에 기록한다.",
    answerb: "그때그때 기분과 상황에 따라 고양이와 무엇을 할지 결정한다.",
    type: "JP",
  },
  {
    id: 11,
    title: "새로운 고양이 용품을 구매할 때, 당신의 접근 방식은?",
    answera:
      "고양이에게 필요한 용품 리스트를 미리 작성하고, 비교 분석 후 구매한다.",
    answerb:
      "상점에서 눈에 띄는 흥미로운 용품을 발견하면 spontanious하게 구매한다.",
    type: "JP",
  },
  {
    id: 12,
    title: "고양이와의 일상에서 당신이 가장 중요하게 생각하는 것은?",
    answera: "일정한 패턴과 규칙을 통해 안정적인 환경을 만드는 것",
    answerb: "상황에 따라 변화하는 유연한 접근 방식을 유지하는 것",
    type: "JP",
  },
];
